[
  {
    "time": "30/05/2025 02:27",
    "email": "m0556721587@gmail.com",
    "fullName": "מיכל עמראני",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://photo-challenge.onrender.com",
    "feeling": "סיפוק עמוק, לא רק מהתוצאה אלא מהדרך שלימדה אותי שאני מסוגלת זו נקודת פתיחה לעוד הרבה שארצה ליצור.",
    "benefit": "למדתי איך לחלק משימות, איך לעבוד עם API בצורה מקצועית, איך לנהל גרסאות ולפתור תקלות בזמן אמת. הוא גם חידד לי את היכולת לחשוב צעד קדימה בתכנון – לא רק איך הקוד יהיה מקצועי ונכון, אלא גם איך להנגיש את המערכת בצורה ברורה ונעימה למשתמש.\nמעבר לזה, העבודה עליו לימדה אותי איך לפעול בצורה מתוכננת, מסודרת וחכמה – להציב מטרות כזה...",
    "recomendation": "הייתי אומרת לה לא לפחד להתחיל אפילו אם לא הכול ברור מההתחלה – הרבה דברים מתבהרים תוך כדי תהליך. כן חשוב להתחיל מתכנון ברור, ולזכור שהפרויקט הוא הזדמנות לנסות, ליפול, וללמוד באמת. והכי חשוב – ליהנות מהתהליך, כי בסוף זה רווח עצום שיקפיץ אותה גבוה.",
    "proud": "אני הכי גאה בזה שהצלחתי להתמודד בעצמי עם כל האתגרים – מבאגים מסובכים ועד בנייה מלאה של המערכת, גם בצד השרת וגם בצד הלקוח. זה לא פיצ’ר אחד מסוים, אלא התחושה שעם כל שלב שצץ – ידעתי לעצור, להבין, ולפתור. העובדה שהצלחתי להרים מערכת שלמה בעצמי, מהעיצוב ועד הלוגיקה, נתנה לי ביטחון שאני מסוגלת להתמודד גם עם פרויקטים גדולים ומורכבים."
  },
  {
    "time": "30/05/2025 02:32",
    "email": "diti3809@gmail.com",
    "fullName": "דיתי קליין",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://studystream-rgv5.onrender.com",
    "feeling": "אני מרגישה ספוק עמוק, הנאה מהישג, ויוצאת עם נסיון יקר מאד שהולך איתי הלאה",
    "benefit": "מעבר לסיפוק, הפרויקט הזה קידם אותי מקצועית ברמות. הוא אילץ אותי להעמיק ב־Redux, Angular, React, שליחת מיילים ב־.NET, ניהול קבצים ב־AWS, עיצוב עם MUI ועוד. כל שלב דרש ממני לחשוב, לתכנן, לפתור תקלות – וזה פיתח אצלי עצמאות, ביטחון וובמיחד חידד אצלי את היכולת לעבוד על מערכת שלמה (פשוט נכס)",
    "recomendation": "לא להבהל!!! שזה הדבר הכי מושלם שיכול להיות לעשות כזה פרויקט בכזו רמה -הדרך שווה את התוצאה",
    "proud": "אני הכי גאה בפיצ'ר של מערכת ניהול קבצים ושיעורים שכוללת העלאה, הקלטה, ארגון בתיקיות, תצוגה ברורה, ואפשרות לתמלול וסיכום.\nהשקעתי הכי הרבה בחיבור בין ה-Frontend ל-Backend – איך הנתונים עוברים, נשמרים, מעודכנים ומוצגים. התמודדתי עם המרות דיבור לטקסט, ניהול תמלולים, חלוקה לתיקיות, יצירת מודלים להעלאת קבצים הכל במבנה ברור ונקי"
  },
  {
    "time": "30/05/2025 02:34",
    "email": "f0548573828@gmail.com",
    "fullName": "אפרת אביגיל ישראלי",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://my-react-project-6w5y.onrender.com/",
    "feeling": "היה קשה! היה שווה!",
    "benefit": "עכשיו אני יודעת שאסור להתייאש,\nצריך להתעקש!",
    "recomendation": "הייתי ממליצה לה להבין קודם כל מה הדרישות כוללות,\nואז להתחיל פסיעה.....פסיעה....\nוגם...\nלא להבהל מבאגים גדולים,\nבסוף מסתדרים!",
    "proud": "וואוו... יש לי כ\"כ הרבה לכתוב.....\nאני שמחה שהצלחתי לעמוד באתגר בהצלחה,\nשהצלחתי להתמודד לבד!!!\nזה בהחלט היה מתיש\nאבל שווה ומספקק!!!\nהמורה אמרה לי בפגישת הסטטוס לא לעשות את אנגולר,\nובכל אופן התאמצתי כ\"כ וברוך ד' אני מסיימת...."
  },
  {
    "time": "30/05/2025 02:46",
    "email": "m0527169791@gmail.com",
    "fullName": "מלכה אלקיים",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://myalbum-user.onrender.com/",
    "feeling": "היה שווה כל המאמץ!!",
    "benefit": "לא להבהל גם אם זה נראה דבר שאף פעם לא עשיתי אותו ולדעת להסתדר לבד",
    "recomendation": "לא לחשוב מה יהיה בשלב הבא אלא להתמקד כל פעם במה שצריך לעשות עכשיו וגם לחשוב לפני זה אם יהיה קשה לעצב אפילו שזה נשמע טפשי לחשוב על עיצוב (אני קצת הסתבכתי)",
    "proud": "על התוצאה, הפיצ'ר AI שאחרי שמחזיר תאור שם אלמנטים בהתאם , העיצוב היפה הלוגיקה וכל הפרויקט בכללותו שבס\"ד בלבד סימתי"
  },
  {
    "time": "30/05/2025 03:01",
    "email": "sh0556745370@gmail.com",
    "fullName": "שני גולדוסר",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://cryptoguardapplication.onrender.com/",
    "feeling": "אני רוצה להמשיך ולפתח ולשכלל את המערכת שלי....",
    "benefit": "יכולת הבנה מקצה אל קצה איך מערכת עובדת \nהתנסות מלאה ואמיתית עם .NET וריאקט \nחשיבה מערכתית מול תשומת לב לפרטים \nסבלנות, פתירת באגים יכולת התמדה וריכוז גבוהה\nכתיבת פרומפטים לAI נכונים ומדוקים שמביאים תוצאה טובה",
    "recomendation": "לא לבנות רק ריאקט או רק סרבר אלא לבנות משהו במקביל \nכמו למשל הרשמה שעובדת גם בקללינט וגם בסרבר וכדומה\nאני עשיתי ככה וזה היה ממש מוצלח!\nתשאלי את הצאט הכל אל תנסי לבד!\nאבל חשוב מאד לא לעשות C ^V^ בלי להבין מה הוא הביא לך \nלא צריך להבין מילה מילה אבל הרעיון של הקוד כן\nזה חוסך שעות של באגים (כי יש טעויות שאת יכולה לפתור תוך שניה וגם יותר קל למקד איפה הבעיה)",
    "proud": "אני חושבת שבכך שהתחלתי את הפרויקט רק אחרי פסח ויש לי אפליקצית ריאקט מלאה ועובדת ב\"ה\nאין לי כ\"כ פיצרים מיוחדים (אבל יהיו... )\nאבל אני מרגישה שלא בניתי עוד \"מערכת העלאת קבצים\", אלא מערכת הצפנת קבצים חכמה, מאובטחת, בנויה נכון – עם חשיבה לעומק על שימוש אמיתי."
  },
  {
    "time": "30/05/2025 08:41",
    "email": "bz0556758244@gmail.com",
    "fullName": "ברוריה זרביב",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://businessman-fuov.onrender.com",
    "feeling": "היה טוב!",
    "benefit": "פתירת באגים! מכל כל כל כל הסוגים... וגם לדעת למצוא דברים שאני צריכה עם GPT. לדעת איך לשאול אותו. למדתי המון על ניהול משתמשים. קיבלתי המון ביטחון בידע ובכלים שיש לי וביכולת להרים פרויקט כזה מקיר לקיר - לבד!",
    "recomendation": "הפרויקט מעשיר ומחכים בסדר גודל, את תהיי מאסטרית!",
    "proud": ""
  },
  {
    "time": "30/05/2025 10:23",
    "email": "racheli74621@gmail.com",
    "fullName": "רחלי רוזנטל",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://users-tuvumarpeh.onrender.com",
    "feeling": "סיפוק אדיר ותחושת ביטחון!",
    "benefit": "הפרויקט שיפשף אותי מאד ב NET. באנגולר ובריאקט זה נתן לי הבנה רחבה וביטחון להשתמש בשפות",
    "recomendation": "שווה מאד מאד kהשקיע בזה זה נותן סיפוק אדיר וכמובן גם נחמד מאד שיש מוצר כמעט שלם ביד!",
    "proud": ""
  },
  {
    "time": "30/05/2025 10:25",
    "email": "rrm85040@gmail.com",
    "fullName": "רחל מנטל",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://tuneyourmood.onrender.com",
    "feeling": "מאתגר!! אבל שווה!!",
    "benefit": "לעשות כזה דבר מקצה לקצה הוסיף לי המון, לא לפחד מדברים חדשים, ומה שרוצים ומתאמצים בסוף מצליחים....",
    "recomendation": "אל ייאווש... גם אם זה נראה אפילו מאיים זה פשוט כדאי... זה מאד מעלה את הרמה!!",
    "proud": "השילוב של הכל ביחד..."
  },
  {
    "time": "30/05/2025 10:57",
    "email": "sh0527132865@gmail.com",
    "fullName": "שיפי שיף",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://practicumproject-reactclient.onrender.com/",
    "feeling": "סיפוק אדיר והודיה להקב\"ה שיחסית לא היו לי הרבה באגים ובאגים שהיו נפתרו ב\"ה יחסית מהר\nותודה רבה לסמינר שלא ויתר לנו על הפרויקט:)\nולמורה על הליווי והעזרה הגדולה!!",
    "benefit": "הפרויקט קידם אותי ברמות\nהוא חיבר שנתיים של למידה לפרויקט עצמאי מ-0 כולל DB, שרת, קליינט, ענן - הכל!!\nהוא נתן לי אפשרות לראות קצת לטווח רחוק כי כשכתבתי פונקציה בשרת הייתי צריכה לחשוב מה יהיה השימוש שלה בקליינט או מה אני ארצה לעשות עם הפונקציה הזו בעתיד וכו'",
    "recomendation": "הייתי אומרת לה שזה באמת פרויקט רציני ודורש וצריך להקדיש לו את כל הזמן הראוי לו ולא שעה ביום\nאלא להתחיל מוקדם לשבת איתו כמו שצריך ובעז\"ה אחרי העבודה הקשה יגיע השכר גדול- פרויקט אמיתי שלך!! שאת פיתחת מתחילתו ועד סופו שרץ ברשת!! ואת המיומנות והשליטה שיש אחרי הפרויקט לא היית משיגה בשום דרך אחרת!",
    "proud": "אני הכי גאה בזמנים שהגדרתי לעצמי ועמדתי בהם בהצלחה למרות העומס של ערב פסח וכו' -אצלי ערב פסח הפרויקט היה מוכן ואחרי פסח רק התקשקשתי איתו להנאתי\nאני גאה גם בפיצר AI שעשיתי שהוא שונה ממה שבנות שעשו פרויקט כמו שלי עשו שזה משהו מוכן\nאלא אני ממש חיפשתי KEY מתאים וישבתי עליו הרבה זמן עד שזה עבד מושלם!\nבנוסף לבעיה שהיתה בAWS בגלל נטפרי שבזכות הבעיה הזו האנגלית שלי השתפשפה מאוד אחרי 3 שעות שיחה עם מרכז התמיכה שלהם וגם כל שאר הבנות באו אל המוכן והסברתי להן מה לעשות כדי לפתור את הבעיה\nאני גם שמחה שלפני פסח לא השתמשתי בכל הכלי AI לעיצוב כי רציתי להשתפשף ולנסות בעצמי אבל אחרי פסח שכבר ראיתי שאני יודעת גם לעצב, נתתי לAI לעצב לי בצורה יותר מושכת ומורכבת"
  },
  {
    "time": "30/05/2025 10:59",
    "email": "n87891@gmail.com",
    "fullName": "נאוה שפירא",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://hirespherereact.onrender.com",
    "feeling": "מזמור לתודה\" -שהגעתי ליום הזה דבר ראשון ועוד בצורה שכיף לי להמשיך לשבת על הפרויקט , מרגישה שהגעתי למקומות שלא הייתי מגיעה לפני , והמון סיפוקקק",
    "benefit": "קיבלתי המון ביטחון – גם מבחינה מקצועית וגם אישית. למדתי איך נראית עבודה אמיתית בתנאי לחץ, ואיך אני מתמודדת עם אתגרים מורכבים. העבודה עם טכנולוגיות מתקדמות, בסה\"כ חיזק אצלי את התחושה שאני נמצאת במקום שמתאים לי, שאני אוהבת אותו ורוצה להעמיק בו.",
    "recomendation": "הייתי ממליצה לה לא לפחד להתחיל. הרעיון הראשוני יכול להיות פשוט, אבל תוך כדי תהליך רואים איך הכל מתפתח. הכי חשוב – לבחור נושא שמעניין אותך באמת, כי זה מה שישאיר אותך עם מוטיבציה גם ברגעים מאתגרים. (ויש כאלה...)",
    "proud": "ההשקעה המרכזית שלי הייתה בתהליך המלא של ראיון למועמד: העלאת קו\"ח, ניתוח קו\"ח עם AI, מבחן קוד, שיחת וידאו לראיון – כל השלבים ליצירת תהליך מקצועי של גיוס עובדים,\nאני שמחה שהצלחתי לבנות את כל זה מקצה לקצה – בצורה מודרנית, נוחה ונגישה."
  },
  {
    "time": "30/05/2025 12:52",
    "email": "btr96180@gmail.com",
    "fullName": "בתיה רובינשטיין",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://final-project-react-6ltf.onrender.com",
    "feeling": "אין דבר העומד בפני הרצון. לא יאומן שבנות שרק שנתיים בעולם התכנות מוציאות כזה דבר.",
    "benefit": "לעבוד על דברים במאקרו ולא במיקרו. אף פעם לפני זה לא היה לי את תזה.",
    "recomendation": "תעבדי בצורה שהכי מתאימה לך - אם בצורה מסודרת ומאורגנת הכי הולך לך - מצוין. אם בקו רוחב ובצורה פחות מסודרת יותר הולך לך - גם טוב. העיקר מה הכי טוב לך.",
    "proud": "בחילוץ הנתונים מהחשבונית. שימוש ב api, קריאת הנתונים וכו'"
  },
  {
    "time": "30/05/2025 13:20",
    "email": "t48465746@gmail.com",
    "fullName": "טובי קרביץ",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://cllickwise-maneger.onrender.com",
    "feeling": "...ברינה יקצרו.. היה עבודה אורכה ולהתנסות ולהצליח, ובעיקר גדלנו מזה בתחום.",
    "benefit": "להבין טוב ולעומק את כל התהליך בשרת, להתנסות בבאגים להבין אותם ולסדר כמובן,\nלהקים מערכת גדולה מורכבת מכמה דברים, לחשוב מאפס איך להתחיל ואיך לבנות.",
    "recomendation": "לא להתעכב על עיצובים - בשביל זה יש AI\nוגם על כל מיני דברים קטנים לא קריטיים לשותף של המשך הכנת הפרויקט לא להתעכב אח\"כ מסדרים ותמיד יש עוד באגים.\nולהתחיל בגדול בחלק של צד לקוח לא עוד פונקציה ועוד אחת, אלא את כל העמוד הנוכחי כי עושים כל מיני קומפוננטות משותפות.",
    "proud": "על הפיצ'ר של AI לא באמת ידעתי מה לעשות כי יש לי כבר חיפוש רגיל, והוספתי חיפוש מתקדם עם AI כי תמיד לא זוכרים איזה מילה והחיפוש הרגיל לא עוזר שיהיה נוח ובקלות לחפש יותר בחופשיות."
  },
  {
    "time": "30/05/2025 14:00",
    "email": "etinger355@gmail.com",
    "fullName": "דבורה אטינגר",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://react-drow.onrender.com/",
    "feeling": "היה מאתגר !! ומשפשף...",
    "benefit": "\\בניהול זמן בלדעת להסתבך ועוד......",
    "recomendation": "שתנשום עמוק.... ותחלק את המשימות למשימות פיציות ותתמקד כל פעם במשימה קטנה....",
    "proud": "בעיצוב נהנתי להשקיע בו!!!"
  },
  {
    "time": "30/05/2025 14:27",
    "email": "r0583237001@gmail.com",
    "fullName": "רחלי שחר",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://fs-project-client.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "שלמרות שהפרויקט נראה הר שאי אפשר לעבור זה שווה וברגע שמתחילים ונכנסים לזה רואים שאפשר לעמוד בזה וזה נותן סיפוק מטורף,",
    "proud": ""
  },
  {
    "time": "30/05/2025 15:08",
    "email": "c81051@gmail.com",
    "fullName": "חיה אתרוג",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://pixhiveapp.onrender.com/",
    "feeling": "התחלתי עם רעיון, סיימתי עם מערכת – והלב מלא סיפוק.",
    "benefit": "הפרויקט חידד לי את היכולת לנהל מערכת מורכבת מקצה לקצה – גם בצד השרת וגם בפרונטאנד. הוא חיזק בי ביטחון בעבודה עם טכנולוגיות מתקדמות, שיפר לי את החשיבה המערכתית, והעמיק את ההבנה שלי בעיצוב חוויית משתמש.\nמעבר לזה, הוא גרם לי להבין כמה חשוב לשלב יצירתיות עם תכנון מדויק – והפך אותי למפתחת מנוסה יותר.",
    "recomendation": "תתחילי בלתכנן טוב: אל תתפזרי – תבני חזון ברור, תדעי מה חובה ומה בונוס.\nתבני את הבסיס כמו שצריך – הקשרים בין היישויות, מבנה הנתונים, עקרונות המערכת – ואל תמהרי לרוץ לפרונט.\nאל תפחדי להשתמש בבינה מלאכותית – זה לא מסובך כמו שזה נשמע, וזה נותן תחושת \"וואו\" גם למשתמשים וגם לך.\nוהכי חשוב: תיהני. הפרויקט הזה יכול להיות חוויה שמגדירה אותך.",
    "proud": "אני הכי גאה בשילוב של עיצוב חדשני עם יכולות עיבוד תמונה חכם. השקעה רבה הושקעה ביצירת חוויית משתמש אינטואיטיביתומושכת, לצד עבודה על פיצ'רים מתקדמים כמו העלאת תמונות, ניהול היררכי של אלבומים, ויכולות בינה מלאכותית שנותנות לכל משתמש תחושת שליטה וחדשנות.\nאחד הרגעים המאתגרים והמספקים היה כשהצלחתי לגרום ליצירת קולאז'ים לעבוד בצורה אוטומטית עם ממשק AI חיצוני, כולל תצוגה מקדימה והורדה."
  },
  {
    "time": "30/05/2025 15:11",
    "email": "t0534198344@gmail.com",
    "fullName": "תהילה הרשלר",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://flashwish-client-users.onrender.com/",
    "feeling": "היה וטוב שהיה - נגמר וטוב מאד שנגמר (-נגמר טוב....:):))",
    "benefit": "כמובן שפשוף וידיעות, ביסוס החומר ויכולת עבודה מעשית ולמידה עם AI.",
    "recomendation": "בשלב של הלמידה - לא לעשות 100% רק עם GPT.",
    "proud": ""
  },
  {
    "time": "30/05/2025 18:39",
    "email": "8578397@gmail.com",
    "fullName": "אסתר אסחייק",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://learnix.onrender.com/",
    "feeling": "היה מאתגר וגם דורש אבל ממלא בסיפוק עצום.",
    "benefit": "דבר ראשון בהכרות מעמיקה עם AWS ועבודה יסודית עם קבצים וכן בהרגשה שלי זה היה העולם האמיתי הסטא'ז הקרוב ביותר לעבודה שהיה לי עד עכשיו...",
    "recomendation": "דבר ראשון לתכנן מראש באילו אתגרים היא עלולה להיתקל ... (בנימה אישית שכחתי לחשוב על נטפרי כשהחלטתי על הפרויקט שלי של מערכת למידה...) דבר שני לא להיבהל מבאגים- הם רוב זמן הפיתוח :)",
    "proud": "אשתף בשני דברים: דבר אחד תמיכה בהצגת קבצי וידיאו ואודיו (דבר מסובך בפני עצמו שכולל החסימות של נטפרי היה נראה בלתי אפשרי וב\"ה קרה הנס...) דבר שני תמלול אוטומטי תוך כדי צפיה בהסרטה בקצב הדיבור כולל תמיכה באנגלית ועברית ושמירת קבצי התמול גם כן ב AWS"
  },
  {
    "time": "31/05/2025 21:24",
    "email": "d0548431932@gmail.com",
    "fullName": "דבורי פוגלבלט",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://music-v0mi.onrender.com/",
    "feeling": "בשבח ובהודיה לבורא עולם שהחיינו וקיימנו והגיענו לזמן הזה... ובתודה למורה על המחשבה והאמון בנו אני כבר מרגישה מתכנתת 👨🏼‍💻",
    "benefit": "התעסקות מרובה עם קריאות לשרתים וכו'\nהגישה שלי לבעיות היא אחרת לגמרי היום \nלא שאין בעיות אבל מטעיות לומדים והרבה\nלדעת באיזה סוג של שפה אני טובה יותר \nלדעת להשתמש גם בכל המסביב התקנות תלויות ועוד",
    "recomendation": "שתתפלל תשב ותחשוב מראש במה לשים את הדגש ולהשקיע ושתתחיל עם העיצוב מההתחלה ברמת claude ולא פחות אחרי זה זה יותר מורכב \nשתחשוב על השרת טוב ותתן לו פונקציונליות גבוהה וטובה",
    "proud": "חיפוש חכם באמצעות ai השתמשתי בדטה וקטורי ובניתוח על ידי בינה ואני לא האמנתי כשזה עבד לי"
  },
  {
    "time": "31/05/2025 21:28",
    "email": "a0583273344@gmail.com",
    "fullName": "אביטל פרג'י",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://devworksemployers.onrender.com/",
    "feeling": "",
    "benefit": "הפרויקט בכללותו נתן לי הרבה ביטחון.\nבלהסתדר עם שגיאות, ביכולת שלי לכתוב קוד.",
    "recomendation": "קודם כל- תעלי לענן ותחברי למסד נתונים חיצוני. גם לפני שיש לך בכלל מה לראות.\nראיתי שזה ממש מקל, וחוסך הרבה זמן וכאב ראש לפני ההגשה.",
    "proud": ""
  },
  {
    "time": "31/05/2025 21:32",
    "email": "bitya32885@gmail.com",
    "fullName": "בתיה סלר",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://household-smart-managment.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "31/05/2025 21:42",
    "email": "nechami3142@gmail.com",
    "fullName": "נחמה טולידאנו",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://pictune-ai.onrender.com",
    "feeling": "",
    "benefit": "אחרי שעברתי ראיון עבודה, אני יכולה לומר בביטחון שהפרויקט תרם לי המון.\nהוא העניק לי משהו ייחודי לדבר עליו – פיתוח אישי שלי, שעבדתי עליו מקצה לקצה, והשקעתי בו באמת.\nזה מעניק תחושת ביטחון, ומאפשר להציג עשייה ממשית ומוחשית.\n\nבנוסף, אני מרגישה שהפרויקט הזה הכין אותי בצורה הטובה ביותר לעבודה בשטח:\nללמוד דברים חדשים, ליישם בפועל את מה שלמדנו, להתמודד עם באגים אמיתיים, ולעמוד ביעדים ובלוחות זמנים.\n\nמודה מאוד על ההזדמנות והניסיון – זו הייתה הכנה מצוינת לקראת הכניסה לתעשייה בעז\"ה.",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "31/05/2025 22:08",
    "email": "1020nomi@gmail.com",
    "fullName": "נעמי קולין",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://image-editor-amq7.onrender.com",
    "feeling": "בהתחלה היה נראה בלתי עביר, אבל ב\"ה - אנחנו בשלב הסופי...\nוזה הזמן להגיד תודה - על העידוד והאימון לאורך הדרך...\nאני חושבת שהפרויקט נתן לי וקידם אותי הרבה.",
    "benefit": "המון דברים קטנים שיותר התחדד לי בהבנה, בעיקר בפיתוח פרויקט מקיף בריאקט ובדוטנט, להבין איך עובד, ואיך זה מתנהל, וגם נושאים קטנים שלומדים תוך כדי.\nוגם קיבלתי הרבה ביטחון וראיתי שכל שעם הרבה עבודה - בסוף אפשר הכל :)",
    "recomendation": "להגדיר טוב את המטרות ואת היעד.\nוגם לנהל תוך כדי מסמך איפה עומדים בכל דבר,\nבגלל שעשיתי הרבה דברים במקביל - לפעמים זה היה יכול לעזור...",
    "proud": "ניהול הקבצים בתיקיות, כששיניתי מרשימת קבצים אחת לתיקיות וסדר היררכי, הצריך הרבה עבודה ומחשבה, איך לשמור ולהוסיף וכו'.\nוגם הפיצ'ר של AI, להשתמש בו בצורה נכונה, והרבה מזה היה גם לדייק את הפרומפט."
  },
  {
    "time": "31/05/2025 22:46",
    "email": "sh0548421636@gmail.com",
    "fullName": "נעמי דרבקין",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://calendar-react-client.onrender.com",
    "feeling": "התחושה הזו של 'סיימתי' אחרי כל כך הרבה עבודה. מתישה – אבל שווה כל רגע! \nתודה רבה!",
    "benefit": "היו כמה דברים שמאד קידמו - ונתנו ניסיון שלא היה בפרויקטים קטנים יותר.\nדבר ראשון זה החלק של הגודל - להתעסק עם פרויקט גדול עם המון דפים ושני אפליקציות קליינט ולא להרגיש שנעלמים בתוכו.\nהדבר השני זה שהיינו צריכות להשתמש בהרבה דברים שלא למדנו והתנסנו בעבר - וכל העניין של החיפוש אחריהם מאד הכניס אותי לעניין של לימוד עצמי.",
    "recomendation": "שכל ההתחלות קשות ! ושזה הר עביר.\nותמיד יש תשובות ופתרונות לבאגים - וGPT וחברות שמחות לעזור!\nושתעשה את זה בכיף ותשב עם חברות וגלידה!\nלא צריך להוסיף עונש על עונש :)",
    "proud": "החלק שהכי מעודד פה בסיפור----\nזה - שאחרי כל השעות והזמן וכווו' ......... \nיש לי משהו בידיים - משהו שעובד וזז (וכמעט נושם :)"
  },
  {
    "time": "31/05/2025 22:52",
    "email": "tamar96033@gmail.com",
    "fullName": "תמר ראם",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://photoalbumclient.onrender.com",
    "feeling": "",
    "benefit": "אחרי הרבה יזע ועבודה קשה!!!!\nמה שאני יכולה להגיד שהכי התחדש לי בפרויקט היה השימוש בAWS.\nבעיקרון, זה היה ממש לא הגיוני להביא לנו לשמור קבצים בלי שהיה לנו מושג בכלל מה זה S3 ואיך משתמשים בו וכו'\nנראה לי שבאיזור חודש (חצי מהזמן), רק ניסיתי לפתוח חשבון ולהיכנס ולהעלות תמונות.\nלא היה לי מושג איך עושים את זה ולא הייתה שום הדרכה.\nבסוף!!!!!!!!! אני יכולה להגיד שאני מכירה שם ישר והפוך כל תג וכל טעות שאפשרי להיתקל בה במהלך ניהול תמונות ב S3.",
    "recomendation": "היה לי קטע כזה שלא כל כך הייתי ברורה על עצמי איך זה יראה ומה באמת יהיה באפליקציה שלי,\nלמרות שהמורה ניסתה ככל האפשר שנגיש אפיון בהתחלה וכו'\nואח\"כ זה התנקם בי בגלל שהיה לי דבר ראשון הרבה בלאגן,\nוגם בכל שלב מחדש הייתי צריכה להחליט מה עכשיו השלב הבא ולתכנן איך זה אמור להיראות.\nהגדרתי הרבה טבלאות מיותרות כי החלטתי דבר ראשון להתחיל...\nאמנם, מה שהמורה הגדירה עזר אבל אני הייתי ממליצה לבת לפני פיתוח שתעשה אפיון יותר ברור ולא תשאיר חלקים לא ברורים לטיפול בהמשך....",
    "proud": "כשרציתי לעשות קריאות API לשרת.\nגיליתי כלי NSWAG שכותב את הקוד בTYPESCRIPT של הקריאות לשרת ע\"י שהוא קורא אותם מהSWAGGER.\nקצת חקרתי את הנושא והשתמשתי בו.\nזה היה ממש נחמד לגלות כזה כלי שמבצע בקונפיגורציה מדויקת את כל הקריאות שרת."
  },
  {
    "time": "31/05/2025 22:55",
    "email": "y0548566763@gmail.com",
    "fullName": "יעלי כהן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://github.com/yaelprograming/TakeAPeek.git",
    "feeling": "שלום המורה!\nלא הצלחתי להעלות את הפרויקט לענן,\nואני לאחר נסיונות רביםםםםםםםםםםםםםם\nבעזרת ד' אחרי החג אני אנסה שוב,\nואלי גם אמצא אנשים שיעזרו לי.\nלבינתיים שמתי בקישור את הקישור לפרויקט בgit.\nתודה רבה (ושהמורה תתפלל שזה יעבוד........😟)\nחג שמח!",
    "benefit": "דבר ראשון קידם אותי מאוד באמונה--- העמיד אותי בפני רגעים שלא הייתי מאמינה שאני יעמוד בהם...\nוגם-\nקידם אותי מאוד בעבודה עם git, \nולימד אותי מלאאא חומר חדש!!!",
    "recomendation": "להעלות את הפרויקט כבר בהתחלה לענן!!! ולא להתיאש- הכל אפשרי!",
    "proud": "על כל הפרויקט- בגדול..."
  },
  {
    "time": "31/05/2025 22:58",
    "email": "102004m@gmail.com",
    "fullName": "מיכל פרישמן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://paint-me-application.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "31/05/2025 23:22",
    "email": "t0504114734@gmail.com",
    "fullName": "ציבי סולובייצ'יק",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://muganim.onrender.com",
    "feeling": "קצת הלם שהגענו לרגע הזה בשלום - שהאמת , מתחשק לי שוב... תודה !!",
    "benefit": "ניהול של התיקיות בגיט - ידעתי כללית איך עובדים עם גיט ,אבל הפרויקט הזה גרם לי לקלוט את התועלת שבדבר ולהשתמש בה - לשחזר גירסאות קודמות של קבצים וכדומה.",
    "recomendation": "להשקיע עוד באפיון לדייק עם עצמך קודם מה את רוצה ואיך זה אמור להתממש. ליצור לעצמך הוראות שתוכלי לצעוד לפיהן ולא לאבד ידיים ורגליים בתוך כל התיקיות והקבצים.",
    "proud": "המאמץ שלי לכתוב לבד לא להעתיק כל דבר מ GPT ,אבל לדעת איך לשלב אותו בעבודה כשצריך.\nההרגשה שהפרויקט לא החכים את הבינה אלא אותי..."
  },
  {
    "time": "31/05/2025 23:26",
    "email": "rclg8265@gmail.com",
    "fullName": "רחלי גרינוולד",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://edushare-z8ti.onrender.com/",
    "feeling": "סיפוק עצום אבל האמת שעם הזמן הרגשתי מיותרת לגמרי כי כמעט בלחיצת כפתור אחת אפשר ליצור את כל הפרויקט שעבדתי עליו שבועות.",
    "benefit": "יותר הבנה מערכתית והתממשקות עם כלים חיצוניים כמו AWS ועוד המון המון",
    "recomendation": "אמנם יש היום הרבה כלים ליצור את כל הפרויקט בתוך דקות אבל בסופו של דבר כדי לעבור ריאיון ולהתקבל לעבודה אין שום chat (בד\"כ) וצריך לדעת יותר ולכן להבין את כל הקוד ולא להעתיק סתם.\nוכן כל יום לכתוב בנקודות מה אמורים להספיק היום ולהיצמד לזה\nכך גם מרגישים סיפוק וגם העבודה יותר ממוקדת",
    "proud": "האמת כמעט בכל דבר היה צריך השקעה ושום דבר לא בא בקלות\nאבל בשביל להעלות את הקבצים ל AWS הייתי על זה בערך 3 ימים ובסוף הבעיה הייתה שרשמתי - במקום נקודה."
  },
  {
    "time": "31/05/2025 23:43",
    "email": "l0533167552@gmail.com",
    "fullName": "לאה קלינמן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://klix-link-client-react.onrender.com",
    "feeling": "מלאת סיפוק וגאווה!-תודה על האפשרות",
    "benefit": "פתח לי אופקים לחשוב מעבר ... קידם אותי ביכולת לפתח דברים חדשים ולא מוכרים ולא להיבהל מהם!",
    "recomendation": "לנסות ללמוד בפיתוח הפרויקט -דברים נוספים לא מוכרים שיועילו לפיתוח -כמו להשתמש ב DB שעדין לא התנסה בו ,ומרגיעה אותה שלא תיבהל -זה הר שעוברים אותו בהצלחה:)",
    "proud": "מערכת ה DeskTop שפתחתי -שניתן להוריד אותה דרך האתר ולהתקין אותה בכל מחשב..."
  },
  {
    "time": "31/05/2025 23:52",
    "email": "g0504174541@gmail.com",
    "fullName": "גילה קלינמן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://gks-client-user.onrender.com",
    "feeling": "יגעת ומצאת תאמין",
    "benefit": "תכנון נכון של פרויקט ראיה מערכתית\nלא לפחד מדברים שאף פעם לא התעסקתי איתם-פשוט לקפוץ למים!",
    "recomendation": "לכי על זה ובגדול!!!!\nתהני מכל רגע אל תבהלי מדברים חדשים,\nיש בך את היכולות את עוד תופתעי!!!!!!\nגם אם דברים נתקעים -תזכרי ,לכל בעיה יש פתרון !צריך רק לחפש אותו!\nטיפ שלי לחווית למידה וחקירה קלה:\nתמצאי בת שכייף לך לעבוד איתה ---ואת עבודת החקירה על דברים תעשו ביחד\nזה מאד מלמד -כל אחת עם הראש שלה וחשיבה שלה מביאה כיוונים אחרים\nוגם זה חוסך זמן הדרך יותר קלה ומהירה וכמובן את לא לבד...:)",
    "proud": "אני גאה על כל ההתנהלות הנכונה של השימוש בשרותי הענן שהיה דבר חדש בשבילי(האחסון בAWS שימוש בIAM)\nלמדתי וחקרתי איך להשתמש בצורה הנכונה ביותר דרך הקוד.\nזו היתה חווית למידה עם הרבה סיפוק והנאה"
  },
  {
    "time": "01/06/2025 00:07",
    "email": "uvi69161@gmail.com",
    "fullName": "אובי וינוגרד",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://fullstack-project-react.onrender.com",
    "feeling": "סיפוק עצום!!!!!!!!!!!!\nוגם הקלה גדולה.....\nבסוף זה כבר 3 חודשים יושב לי ליד הלב ודופק שם בקצב מקביל.....:)",
    "benefit": "קידום משמעותי!!!!\nזה נתן לי בטחון בכל מה שלמדתי עד היום, חיבר דברים, נתן ביטוי להמון כלים שלמדנו! גם שפות וגם טכנולוגיות (למעט אסמבלר...:)))\nאני מרגישה שזה כלי מטורף לעמוד איתו מול מראיינים!!!!",
    "recomendation": "קשה מאד אבל שווה!\nלעבוד עקבי ומסודר- להיות מתוכננים עם זמנים אבל בלי לחץ!!!!\nבסוף עם הרבה ס\"ד ואופטימיות מסתדרים😍🤩",
    "proud": "וואי על הכל- אני יכולה להוציא ספר על הפרויקט הזה- לא פחות מ-700 עמודים😂\nלמעשה העמוד של יצירת מפגש- הוא העמוד המורכב, עם הכי הרבה לוגיקה....\nלענין הקריאות לAI דבר ראשון התממשקתי לhebrew.ai וכבר אמרתי למורה שיש להם שם בג (מאובחן:-) (שלהם:-) ולכן יש סיכוי שצריך לשלוח לתמלול כמה פעמים עד שעובד...\nדבר שני הוספתי כפתור של התממשקות ל- openAi עם המפתח של המורה וזה עבד מצוין עד שביום חמישי בלילה פתאום הוא התחיל להחזיר שגיאת 500 וכתב שהמפתח לא חוקי?????? אז לא שיניתי כי מבחינתי זה היה בונוס שהתעסקתי איתו(מדובר על הכפתור של עריכת הטקסט עם AI- בונוס חמוד והוא עבד מהממם אבל....)\nנראה לי זהו...."
  },
  {
    "time": "01/06/2025 00:51",
    "email": "r0527102247@gmail.com",
    "fullName": "רחל פפויפר",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://frameit-g7zf.onrender.com",
    "feeling": "פרויקט בלבדי שלי, כל הזכויות שמורות:)",
    "benefit": "שיפר לי את החשיבה המערכתית, חיזק הבנה מעשית ב- React, .NET, Angular וארכיטקטורה של פרויקט בקנה מידה אמיתי.",
    "recomendation": "אפיון מדויק קודם של המערכת, כולל ספריות איתם להשתמש ובחירת מכוון עיצוב",
    "proud": "ביכולת להפוך רעיון למוצר אמיתי, ובירידה לפרטים הקטנים שהפכו אותו למדויק ונעים לשימוש."
  },
  {
    "time": "01/06/2025 01:16",
    "email": "c89408@gmail.com",
    "fullName": "חני ונדרולדה",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://lingoflow.onrender.com/",
    "feeling": "סיפוק אדיר והנאה - היה כיף לפתח את LingoFlow!!!\nתודה על ההדרכה והליווי!!",
    "benefit": "הוסיף לי ידע ומקצועיות בתכנות ואני חושבת שבס\"ד כשאפתח שוב כזה פרויקט אתחיל ממקום אחר בעז\"ה \n(-הסקתי לעצמי כל מיני מסקנות חשובות)",
    "recomendation": "קודם כל תפילה ונשימה ארוכה אבל זה שווה!!",
    "proud": ""
  },
  {
    "time": "01/06/2025 01:17",
    "email": "m0548564934@gmail.com",
    "fullName": "מיכל איזקוב",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://invitationline-vmg0.onrender.com",
    "feeling": "סיפוקק",
    "benefit": "לימד אותי עבודה בהיקף גדול",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "01/06/2025 01:26",
    "email": "tovi3500@gmail.com",
    "fullName": "טובה יעקבסון",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "artsprint.onrender.com",
    "feeling": "מרגישה שלא סיימתי רוצה להמשיך ולדייק ולהוסיף עוד ועוד...",
    "benefit": "בעקר להאמין בעצמי. כן, כשראיתי את ההנחיות- כבר בהתחלה כמעט התעלפתי! אמרתי שאני לא יודעת מה מדברים איתי, כנראה התבלבלו עם התמחות אחרת, אני לא למדתי לעשות כאלו דברים. והנה גיליתי שבעצם לא כ\"כ נורא. גם אני הצלחתי, ודווקא היה ממש נחמד.",
    "recomendation": "הייתי ממליצה לעבוד עם מנהל משימות יומי. לא להתחיל עם איזה סעיף צדדי שמאיזושהי סיבה לא ברורה יש לי דחיפה לטפל דווקא בו, בעוד יותר חכם להתחיל מענין אחר, וכך בסוף היום מגלים שלא יצאתי עם שום דבר משמעותי. וכן לא לעבור מענין לעניין בלי פשר, להיות ממוקדת במטרה הקרובה.",
    "proud": "העצוב הייחודי, וכן היה לי באג שלא הצלחתי בשום אופן לפתור, לא היה בו שום הגיון!! ובסוף עזר לי לשנות כוון חשיבה- במקום 'לדפוק את הראש' על הבאג הבלתי פתיר הזה, מצאתי דרך לעקוף אותו. ז\"א ממשתי את אותו ענין בדרך שונה, וזה היה רעיון מדהים! מפתיע ברמת פשטותו!"
  },
  {
    "time": "01/06/2025 01:30",
    "email": "shevi3151@gmail.com",
    "fullName": "בת שבע קוקיס",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://workingonit.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "01/06/2025 01:34",
    "email": "zh6737478@gmail.com",
    "fullName": "צפורה אוסטרויל",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://fullstack-nbik.onrender.com",
    "feeling": "וואו,\nבמשפט אחד:\nהיה טוב וטוב שהיה😉",
    "benefit": "הלימוד העצמי!!!!!!!!!\nיש לי בפרויקט הרבה דברים שלא למדנו עליהם..............\nלמדתי להעז לנסות🤔\nוברוך השם להצליח🤗",
    "recomendation": "הייתי ממליצה בעיקר להשקיע זמן בהתחלה כדי למנוע עוגמות נפש ושינויים מרחיקי לכת בהמשך\nלתכנן טוב טוב את המערכת שלך בהתחלה זה יועיל מאד לכל תהליך הפיתוח!\nמדברת מניסיון עגום של כתיבת שרת חדש שבוע לפני פסח........",
    "proud": "יש הרבה.....:)"
  },
  {
    "time": "01/06/2025 01:46",
    "email": "wh.33681@gmail.com",
    "fullName": "הדסה ויזמן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://creativepeak-designer.onrender.com/",
    "feeling": "תחושה של סיפוק והנאה להסתכל על הפרויקט הזה, ודווקא מתוך הבאגים והבעיות וההסתבכויות שהיו בו,\nכי כשבעז\"ה בסוף זה מצליח - הסיפוק הוא פי כמה ומראה כמה התקדמתי בפועל ממנו,\nכי אם לא היו בעיות כנראה שלא למדתי משהו מיוחד בפרויקט הזה ---",
    "benefit": "הפרויקט תרם לי הרבה מאוד.\nהן מבחינת תכנון ובפרט תכנון נכון של פרויקט מקצה לקצה,\nוהן מבחינת הביצוע שדרש חשיבה על כל דבר מה לעשות בשביל זה, איך ואיפה לעשות אותו וכו'.\nזה נתן לי הבנה מעמיקה יותר מהו פיתוח מקצה לקצה וחשיבה אמיתית מה צריך ונכון להיות בפרויקט הספציפי שעובדים עליו.",
    "recomendation": "קודם כל הייתי אומרת לה, שזה פרויקט ששווה את המאמץ!!!\nנכון הוא דורש הרבה, ואפילו הרבה מאוד, אבל ההשקעה שווה את התוצאה.\nלדעת שגם אם בהתחלה 'מאבדים ידיים ורגליים', זה לא נורא כי ככה לומדים,\nועדיף ללמוד קודם על פרויקט דמה מאשר ללמוד את זה רק בעבודה ואז זה קצת יותר מסובך ---",
    "proud": "בהכל השקעתי הרבה, וחשבתי איך לשכלל ולשדרג יותר.\nהיה חשוב לי שזה לא יהיה עוד פרויקט, אלא שזה יהיה משהו מיוחד, ולא יבש...\nוהשקעתי בכך מחשבה רבה. מקווה שגם רואים את זה בפועל ---\nכן אפשר לומר שמכיון שלמדתי גרפיקה היה חשוב לי מאוד גם העיצוב,\nשיהיה כמו שאני אוהבת ויודעת שנכון..."
  },
  {
    "time": "01/06/2025 02:01",
    "email": "m0556777068@gmail.com",
    "fullName": "מרים פרידר",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://react-client-1040.onrender.com",
    "feeling": "מאתגר. מעצים. נותן סיפוק.",
    "benefit": "הפרוייקט לימד אותי להתמודד לבד עם טכנולוגיות שאני לא מכירה, ללמוד לבד בעזרת גוגל/GPT, לא להרים ידיים, בנוסף אני חושבת שהוא מאוד סוגר קצוות ומסכם את כל הפולסטאק בגדול- פעם אחת להכין פרוייקט מקצה לקצה ולקלוט את התהליך.",
    "recomendation": "1. להגדיר יעדים בכל יום מה את רוצה להספיק ולנסות להגיע ליעדים האלו גם אם לא עד הסוף - מלמעלה, תמיד אפשר להשלים חורים. 2. להתייעץ הרבה עם צ'אט AI ולנסות את כל הסוגים עם GPT לא עוזר אז GEMINI או CLOUD וכו' , גם כשמתלבטים באיזה ספריה הכי מתאים להשתמש לנסות לשאול את כולם ולראות מה כולם אומרים. 3. להתייעץ הרבה עם חברות, קרה לי הרבה פעמים שהיה לי איזה באג וסיפרתי עליו לחברה והיא ידעה להגיד לי שגם לה היה את הבאג הזה ואיך היא סידרה אותו, גם לענייני ספריות/ טכנולוגיות מסוימות אין כמו חברה שהתנסתה בזה ויכולה לכוון אותך לא לחזור על הטעויות שלה...",
    "proud": "קיבלתי סיפוק עצום מכך שהצלחתי לממש את הרעיון של הפקת דוח מס אמריקאי על בסיס טופס 106 ישראלי. זה דבר שלא קיים בשוק והרבה בעלי אזרחות אמריקאית התלהבו מהעניין, זה חיסכון של הרבה זמן וכסף. כמובן שכדי לשווק את האתר אצטרך לדבר עם עורך דין ולהתייעץ עם יועצת מס אמריקאית שמכירה את הפרוצדורה הזו, אבל בגדול הצלחתי להוכיח שהרעיון הזה בר מימוש."
  },
  {
    "time": "01/06/2025 02:15",
    "email": "shira0556797080@gmail.com",
    "fullName": "שירה גבאי",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://exampro-isif.onrender.com/",
    "feeling": "",
    "benefit": "נותן המון נסיון",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "01/06/2025 02:27",
    "email": "miri64494@gmail.com",
    "fullName": "מירי אלקובי",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://livefeedback-client.onrender.com/",
    "feeling": "שהחינו וקימנו והיגענו לזמן הזה",
    "benefit": "לדעת להתמודד עם כל דבר כי אין אף אחד שיכול לעזור לי חוץ ממני כל אחת עסוקה בשלה ולאף אחת אין סבלנות באמת להכנס לתוך הקוד שלי...",
    "recomendation": "עיצוב בסוף!!!! אני בזבזתי מליון ימים על עיצובב ובסוף שיניתי הכללל זה סתם חבל עד שלא רואים בסוף את כל התמונה אין טעם לעצב ולהשאר ערים עד 6 לפנות בוקר....",
    "proud": "בכל הפרויקט!!! הוא כל כולו היה חתיכת עבודה... הבאג שלקח לי הכי הרבה זמו לעלות עליו זה היה שלא נתן לי להוריד תמונות וכל קובץ אחר כן ובסוף הבאג היה שא\"א להוריד תמונות עם מקפים מרכאות וכו אז עשיתי פונק שמטפלת בשם של הקובץ לני שמעלה ל S3"
  },
  {
    "time": "01/06/2025 02:29",
    "email": "r0556763949@gmail.com",
    "fullName": "רות כץ",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://practicum2025-tadmit.onrender.com",
    "feeling": "הכל אפשרי, רק צריך לדמיין...😴",
    "benefit": "קידמה? זה לא מילה...😄",
    "recomendation": "פשוט להתחיל, לא לפחד בעז\"ה זה ירוץ (תרתי משמע)👍",
    "proud": "עניין הפיצ'ר AI היה סיפור ארוך, בתחילה רציתי לערוך השוואה בין תוכניות אדריכליות, שAI ישווה ויחזיר מה ההבדלים, ועל מה כדאי ללכת, התעסקתי עם ספריות של קריאת תמונות וכו' עד שהבנתי שמשהו חינמי לא ילך כאן... אז בס\"ד החלטתי להטמיע AI בתקציר של השאלונים, ואז שוב על עניין השאלונים ישבתי הרבה כי הוספתי בשביל זה עוד שני ישויות...\nהסיפוק הכי גדול זה שבס\"ד עם עוד קצת (או הרבה?) עבודה יהיה לאחותי שהייתה לצידי לאורך כל הדרך - אתר ומערכת...😘"
  },
  {
    "time": "01/06/2025 02:40",
    "email": "etti0475@gmail.com",
    "fullName": "אתי כהן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://matchmakingsproject.onrender.com/",
    "feeling": "מרגישה שאני יכולה לדבר בעיניים נוצצות על הפרויקט שהפקתי ואולי אפילו לפרסם אותו באמת \nאגב הערה - נטפרי הסכימו לפתןח לי את האתר רק בתנאי שאני שומרת את הענין בסוד כי לא מצא חן בעניהם הרעיון של אתר שידוכים אז אני מקווה שלא יהיו בעיות בענין הבדיקה",
    "benefit": "זה קידםם אותי בהכל החל מפיתוח אתר לבדד ממש מתחילתו ועד סופו בלי הוראות ברורות מגבוה פשוט האחריות אצלי וכמובן בהתמודדות עם שגיאות לא נעימות בכלל שבסופו של דבר שפשפו אותי",
    "recomendation": "דבר ראשון לתכנן את הזמן לעודד שבסוף ההרגשה מספקת כל כך שאולי שווה התסכול שבדרך...\nולאחל לה בהצלחה רבה 🙂",
    "proud": "ביכולת שלי להשקיע על פרויקט אין ספור שעות"
  },
  {
    "time": "01/06/2025 02:49",
    "email": "rivki9760@gmail.com",
    "fullName": "רבקה מרחבי",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://projectreact-jbkp.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "01/06/2025 03:03",
    "email": "tamar36603@gmail.com",
    "fullName": "תמר וורצל",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://edushare-er29.onrender.com",
    "feeling": "סיפוק! סיפוק! סיפוק!\nמודה להשם על הס\"ד המיוחדת שנתן לי\nוכן\nתודה למורה שייזמה ויישמה את הרעיון הנועז הזה...\nלמרות הקושי-\nזה נתן לי המון המון המון!\nחג שמח!",
    "benefit": "ואי בכ\"כ הרבה דברים!\nאני מרגישה שיש את הלימודים של התכנות שנותנים המון\nויש את הפרויקט שזה הרבה יותר מקורס!\nהיכולות להתמודד לבד לבד---\nלהצליח לבנות מערכת שלמה מקצה לקצה כולל הכל!\nוכמובן כל הכלים והטכנולוגיות החדשות שרכשתי מהלך הפיתוח\nזה אדיר!\nזה נתן לי להרגיש שהכל אפשרי בעז\"ה!",
    "recomendation": "הייתי מעודדת אותה:)\nכי זה אכן קשה מאוד!\nהייתי מחזקת אותה שלא תתייאש...\nומנסה לעזור לה כמה שאפשר...\nעם כל זה הייתי מחזקת אותה שהמאמץ בהחלט שווה את התוצאה!",
    "proud": "אני גאה בהכל--\nכל הפיצרים, הבאגים שבסוף נפתרו ב\"ה והעיצוב המושקע!!!\nאבל אם נדבר על נקודה שהיא יותר מיוחדת\nאז אני השקעתי הרבה מאוד בלוגיקה ובהררכיה מסודרת של הישויות וטיפול בנתונים.\nוכן הפיצר AI שעשיתי בשרת נפרד בפייתון זה גם הצלחה מיוחדת!\nוזה בהחלט נקודות שאני ממש גאה בהם!"
  },
  {
    "time": "01/06/2025 04:04",
    "email": "el8567510@gmail.com",
    "fullName": "רחלי לויסון",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://torah-innovations-react.onrender.com",
    "feeling": "",
    "benefit": "הרמה לפני הפרויקט לא דומה לעכשיו !! כמה טכנולוגיות התקדמתי, כמה חידושים.",
    "recomendation": "אין כמו להיכנס ולדעת שכבשת את האוורסט, כשנמאס לך קצת (רבה...) אז תנסי לחלק את העבודה מחדש בצורה יותר מעניינת.",
    "proud": ""
  },
  {
    "time": "01/06/2025 04:04",
    "email": "r0504180710@gmail.com",
    "fullName": "רחלי טרייטל",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://paintart.onrender.com/",
    "feeling": "אני פשוט שמחה שעשיתי את זה! זה תרם לי המון! ויש לי מלא סיפוק מזה",
    "benefit": "למדתי לשבת בסבלנות ולא להתייאש וכן למדתי שלכל בעיה יש פתרון, רק צריך למצוא אתו...\nלמדתי גם הרבה דברים חדשים שלא הכרתי כמו התממשקות ל-API של AI ועוד...",
    "recomendation": "לא להלחץ מזה, בעידן שלנו עם הAI אפשר לעשות הכל שום דבר לא מידי קשה ל-GPT",
    "proud": "עשיתי עמוד של צביעת ציור דיגיטלית עם מלא אופציות כולל צביעה עם AI וזה העמוד שלקח לי הכי הרבה זמן"
  },
  {
    "time": "01/06/2025 04:25",
    "email": "efratl3164@gmail.com",
    "fullName": "אפרת לביא",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://keepit-client-users.onrender.com/",
    "feeling": "היה טוב וטוב שנגמר!\nותודה על הליווי מתחילה ועד הסוף ועל הנכונות לעזור כשנתקעתי!",
    "benefit": "בפיתוח מערכת מקצה לקצה! בהתמודדות עם שגיאות החל מהגדרות וכלה בשגיאות קוד למינהן...",
    "recomendation": "לעבוד מסודר! רק ככה מצליחים לאחוז ראש ולהבין אח\"כ מה כתבתי אי אז (מנסיון שלי לעומת בנות אחרות...) \nלעבוד מסודר זה גם אומר לא לתקוע פלסטרים על באגים אלא לנסות לפתור מהשורש\nועוד דבר: עיצוב תשאירי לסוף...",
    "proud": "האמת בכל נים ונים בפרויקט אני גאה! במה שמשקיעים - אוהבים:)\nאבל האמת השאלה היא מה אני הכי גאה - אז כמובן בפיצ'ר AI שלי\nבעיצוב הנקי והנעים לעין\nבקוד המסודר"
  },
  {
    "time": "01/06/2025 04:39",
    "email": "rutyh1828@gmail.com",
    "fullName": "רותי הזה",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://client-react-gu3s.onrender.com",
    "feeling": "אני מרגישה שעמדתי לפני הר גבוה ועברתי אותו ברך ד",
    "benefit": "תרם לי לדעת איך לגשת לפרויקט ענק וגם ברמה של הקוד זה פיתח אותי בשפות האלה מאד מאד",
    "recomendation": "הייתי ממליצה לה לא להלחץ וללכת לאט לאט ובסוף מצליחים",
    "proud": "השקעתי גם על באגים שהיו ישבתי הרבה זמן וגם בפיצר"
  },
  {
    "time": "01/06/2025 04:47",
    "email": "ruti8588@gmail.com",
    "fullName": "רות פיינמן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://cvbuilder-r9zr.onrender.com/",
    "feeling": "ברוך שפטרנוווו",
    "benefit": "הוא תרם לי הרבה ידע מעשיו.פפתאום בא לידי שימוש כל מה שלמדנו...",
    "recomendation": "",
    "proud": "הלוגיקה של יצירת הקובץ בפרויקט שלי היתה מורכבת ובזה אני גאה."
  },
  {
    "time": "01/06/2025 05:09",
    "email": "yaelina5261@gmail.com",
    "fullName": "יעל נעמן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://teammettingapplicationreact.onrender.com",
    "feeling": "היה שווה כל מאמץ!!!!\nתודה ענקית על כל ההדרכה על ההגשה והנתינה של פרויקט כזה \nהוא קדם אותי הן מבחינת קוד והן מבחינת חשיבה\nכמובן למידה של שמוש באינטרנט חיפושים בגוגל GPT שרתים שונים ועוד!!",
    "benefit": "הפרויקט נתן לי את המיומנות לקחת על עצמי הכל!! \nמההתחלה של האפיון ובין לבין בבאגים שצצו ועד העלאה לרנדר!!!\nהפרויקט נתן לי בטחון מושלם שאני מסוגלת לעמוד בכזה היקף גדול..",
    "recomendation": "לא לרוץ מיד לשלב של הקוד \nלשים דגש וזמן דווקא על האפיון זה מה שנותן את ההצלחה וההבנה להמשך הפרויקט..",
    "proud": "בה הפרויקט מאוחרי!!\nעם המון הצלחה וסד\nשמחה בכל הפרויקט מהלוגיקה ועד העיצוב\nהוספתי כמה שיותר אופציות חמודות לשימוש ולחווית המשתמש\nהן צאט ושליחת מייל \nישיבות הצוות שנתנות לצפייה רק לפי צוותים\nשמרתי על אבטחה אין אפשרות ללא התחברות משתמש להיכנס לניתובים שונים\nהאנגולר שלי הוא בעצם המזכירה שרק היא יכולה להוסיף משתמשים לאתר אין גישה סתם לאנשים\nבהה מרוצה מאוד"
  },
  {
    "time": "01/06/2025 05:40",
    "email": "ra0583272887@gmail.com",
    "fullName": "רחלי אולמן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://photo-click.onrender.com",
    "feeling": "סיפוק עצום ושמחה על היכולת להגשים פרויקט מורכב לכדי מציאות עובדת ומועילה.",
    "benefit": "למדתי איך לנהל פרויקט בסדר גודל כזה, כולל תכנון מדויק, תיעדוף משימות והתמודדות עם באגים שבאים והולכים\nלדעת להתנהל באופן עצמאי\nהבנה מעמיקה של תהליכי פיתוח ובשליטה בטכנולוגיות חדשות שלא עבדתי איתם עד היום\nהרעיון הזה שאם רוצים אז את הכל אפשר בסוף לעשות כמובן רק עם ס\"ד",
    "recomendation": "הדרישות נראות גדולות מידי וחסרות הגיון אבל בסוף זה אפשרי\nלתכנן היטב לפני שמתחילים לכתוב קוד \nלהעזר בבנות שנתקלו באותם שגיאות\nלשאול GPT הוא עוזר המון!!\nלהקציב יעדים כלומר למשל מה אני רוצה להספיק היום ולעמוד בהם, פשוט לתכנן את הזמן נכון!\nשהמלאכה שווה הן מבחינת הלמידה תוך כדי והן מבחינת התוצר בסוף\nשבהתחלה זה מלחיץ עד שנכנסים לזה ונהנים בסוף מהפיתוח",
    "proud": "דף הקולאז יש בו הרבה אופציות עיצוב \nובכל הפרויקט בכלל הכל מעשה ידי להתפאר..\n\n\n\n\nיכול להיות שיש או שיהיו דברים מעבר למה שכתוב במסמך אפיון שלי!!"
  },
  {
    "time": "01/06/2025 05:46",
    "email": "hilabassis@gmail.com",
    "fullName": "הילה בסיס",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://audiolectures3.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "01/06/2025 06:34",
    "email": "t0556744920@gmail.com",
    "fullName": "תהילה",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://talktome-ai-client.onrender.com/",
    "feeling": "🆓🆓🆓🆓🆓🆓🆓 \nתודה לד'!!!\nתודה למורה היקרה על העזרה והייעוץ\nותודה למורינו GPT הדגול!",
    "benefit": "זה קידם אותי להבין מה תכלס פיתוח כמה תכנון הוא דורש וכמה חשובה ראיה מערכתית ונכונה!\nלמדתי לרתום בצורה נכונה את כלי ה AI וביפרט את ה GPT השונים... \nבין השאר, לטובת העיצוב ופתרון באגים באופן מהיר",
    "recomendation": "שווה שווה שווה!!!\n\n*כל ההתעכבות על תכנון המערכת שווה את זה !\nהיה מעצבן להגיע לשלב סופי בספרינט מסוים ולגלות שבעצם היה עדיף לפתח או להנדס משהו אחרת....\n\n*ספרי לחברות שלך על שגיאות שיש לך או תקלות חמורות- לפעמים זו קבוצת תמיכה שמועילה ומחכימה מאוד!!!!",
    "proud": "וואלה \nהשקעתי ממש בהכל\nהכי קשה היה התכנון והפוזה - של: האם זה בטוח נכון ולעוף עם זה הלאה או שלא....\n\nאני גאה בעצמאות! \nבעובדה שהתמודדתי ממש מדהים, תכננתי ופיתחתי מ 0🙂\n\nבשלב סיום הפרויקט היה לי באג הזוי בטעינת מישתנים בסביבת הענן של רנדר\nלא ישנתי יומיים וכל ה GPT השונים אבדו את הבינה שלהם למול השגיאות שלי! 😣\nבסוף עליתי על זה ! ולבבבדדדד (זה היה משהו פסיכי כמובן 🤣) \nוזה היה רגעים מחוננים ממש ! \nבדרך לפיתרון התחדדו לי כ\"כ הרבה דברים \nשזה אולי לא פייר לומר זאת עכשיו - כשהקונסול שלי נקי משגיאות 🤩 אבל - כן! היה מחכים ושווה...."
  },
  {
    "time": "01/06/2025 07:12",
    "email": "rutprogramming8978@gmail.com",
    "fullName": "רות שטרייכר",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://archisync.onrender.com/",
    "feeling": "הרגשה של סיפוק עמוק – שלקחתי רעיון מורכב, הפכתי אותו למציאות, ויצרתי משהו שאני באמת גאה בו.",
    "benefit": "הפרויקט חידד לי מאוד את החשיבות של תכנון נכון מראש, שילוב של טכנולוגיות חדשות כמו AI בתוך אפליקציה קיימת, והתמודדות עם אתגרים של פרודקשן כמו דיפלוי, טיפול בתקלות, ואופטימיזציה של ביצועים. גם שיפרתי מאוד את כישורי ה־Fullstack שלי – גם בצד ה־UI וגם בצד הארכיטקטורה והשרת.",
    "recomendation": "לא לפחד להתחיל גם אם לא הכול ברור. לפצל את הפרויקט לחלקים קטנים, להבין כל שלב, ולבנות לאט־לאט. והכי חשוב – תיעוד טוב, תקשורת עם צוות (אם יש), ושמירה על מוטיבציה – הם המפתח להצלחה. ואם משהו לא עובד – תחקרי, תשאלי, תתייעצי. זה חלק מהלמידה.",
    "proud": "אני הכי גאה בשילוב המורכב שבין מערכת ניהול פרויקטים, העלאת קבצים, ויצירת תמונות בעזרת AI מתוך סקיצות שצייר המשתמש. כל הממשק, גם בצד ה־Frontend וגם בצד ה־Backend, נבנה מאפס תוך חשיבה על חוויית משתמש, ביצועים וארכיטקטורה ברורה. במיוחד השקעתי בהגדרה של תהליך הריל־טיים בין השרת ללקוח עם SignalR, ובשילוב של השירות החיצוני Replicate.\n\nשימו לב: האפליקציה פרוסה כרגע ב־Railway ותהיה זמינה אונליין רק במהלך החודש הקרוב, בהתאם למגבלות התוכנית החינמית."
  },
  {
    "time": "01/06/2025 10:41",
    "email": "s0534160286@gmail.com",
    "fullName": "שרי סוויאטיצקי",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://singlezone-net.onrender.com",
    "feeling": "תחושת סיפוק עמוק, של צמיחה אמיתית – עשיתי את זה, וגם למדתי על עצמי שאני מסוגלת ליותר ממה שחש",
    "benefit": "את הדבר הבסיסי ביותר - פשוט להתמקצע.",
    "recomendation": "שתתחלי בקטן ותלך מזה אלאה, שתאמין בעצמה ולא תלחיץ את עצמה כי בסה\"כ זה לא כזה מסובך.",
    "proud": "כל דבר אפילו שנראה הכי פשוט וקלאסי בד\"כ דורש מחשבה זמן והשקעה . אולי הפיצר של הPLAYLIST."
  },
  {
    "time": "01/06/2025 12:45",
    "email": "c6738592@gmail.com",
    "fullName": "יוכבד פרוכטר",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://kidscanvasproject-1.onrender.com",
    "feeling": "הודו לד' כי טוב כי לעולם חסדו....",
    "benefit": "להכיר את כל האתרים והכלים המגוונים שהמורה הדריכה אותנו להשתמש בהם ועכשיו זה הרווח שלי!",
    "recomendation": "בהצלחה",
    "proud": ""
  },
  {
    "time": "01/06/2025 13:43",
    "email": "r0556727863@gmail.com",
    "fullName": "רות כהן10",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://albumix.onrender.com",
    "feeling": "תחושת סיפוק גדולה לראות תוצאה ממשית של תהליך ארוך של השקעה ולמידה. תודה על הליווי והמסגרת שנתנו לנו להתקדם בקצב טוב ולהגיע לקו הסיום עם פרויקט שלם ועובד.",
    "benefit": "הפרויקט תרם לי המון – גם מקצועית וגם אישית. הוא חידד את היכולת שלי לפתור בעיות מורכבות, לחשוב יצירתי, לנהל משימות ולשמור על סדר ויעילות. הוא גם חיזק בי את הביטחון לדעת שאני מסוגלת להתמודד עם אתגרים אמיתיים, ולעבוד בצורה עצמאית עד לתוצאה שלמה.",
    "recomendation": "הייתי ממליצה לה להשקיע בתכנון מוקדם ולא לחשוש מהפרטים הקטנים – דווקא הם יוצרים את ההבדל הגדול. חשוב גם להיות סבלנית עם עצמה – ההתחלה תמיד מאתגרת, אבל עם הזמן רואים התקדמות, הביטחון עולה, והעבודה נעשית זורמת ומהנה יותר.",
    "proud": "אני הכי גאה בזה שהצלחתי לבנות מערכת שלמה בעצמי – מהרעיון ועד הביצוע. ההשקעה הכי גדולה הייתה בלחבר את כל החלקים לכדי משהו אחד שעובד בצורה חלקה, בלי לוותר על איכות, עיצוב, ופונקציונליות. זה דרש ממני הרבה התמדה, דיוק, ולמידה עצמאית לאורך הדרך – והיום אני יכולה להסתכל על התוצאה בגאווה ולדעת שבניתי את זה באמת, שלב אחרי שלב."
  },
  {
    "time": "01/06/2025 17:29",
    "email": "tamar05861@gmail.com",
    "fullName": "תמר אנגל",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://sib-client.onrender.com",
    "feeling": "אלוקים גדול תודה לד'!!!!",
    "benefit": "הפרויקט חיבר בין כל הכלים והטכנולוגיות שלמדתי, אבל יותר מזה – הוא קידם אותי מבחינת ביטחון עצמי, למדתי לעבוד בצורה מסודרת מול הדרישות, להבין את מבצעים בפועל את כל מה שלמדתי, ולתכנן תהליכים בקוד קדימה..,",
    "recomendation": "אל תפחדי להתחיל גם אם זה נראה ענק. תפרקי את המשימות לחלקים קטנים, הכי חשוב! אל תוותרי כשמשהו לא עובד – כל תקלה היא שיעור, והכי חשוב – תאמיני בעצמך ותהיי סבלנית..,",
    "proud": "בהכל....:)"
  },
  {
    "time": "01/06/2025 17:30",
    "email": "rut150116@gmail.com",
    "fullName": "רות אנגל",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://pixmix.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "01/06/2025 17:38",
    "email": "r0548428867@gmail.com",
    "fullName": "רות",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://cheers-pjzw.onrender.com/",
    "feeling": "סיפוק, תוצר של עשיה של חודשים בניתי אתר משלי",
    "benefit": "ללמוד להשתמש עם GPT , תכנון נכון משלב האפיון ועד גמר הפיתוח \nקוד ברור יעיל וביצועים מהירים",
    "recomendation": "לא להרתע מהדרישות אפשר לעמוד בהם..\nלא להתעכב על שגיאות מדי הרבה זמן לשאול בנות שנתכלו באותה שגיאה וכמובן GPT ,להציב יעדים ברורים כמה זמן אני מקציבה לכל חלק מהפרויקט ולעמוד ביעדים שהקצבתי!",
    "proud": "השתמשתי בחילוץ מידע מקובץ המשתמש מעלה ספח ת.ז בסיומת png ומקיש ת.ז והמערכת בודקת שהת.ז מותאמת למה שהמשתמש האזין והשתמשת ב OCR לזיהוי תוים בעברית Azure- שירות ענן לזיהוי טקטסט מתאים לתאריכים ומספרים ו Regex לחילוץ דפוסים מהטקסט"
  },
  {
    "time": "02/06/2025 21:46",
    "email": "chy15658@gmail.com",
    "fullName": "חיה צביון",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://prezupusersclient.onrender.com",
    "feeling": "הפיתוח היה מאד משמעותי ואני מאמינה שאני מתאימה להשתלב גם בתפקידים שדורשים עד שנתיים ניסיון",
    "benefit": "למידה עצמית וחשיבה מערכתית",
    "recomendation": "אם תמיד בתכנות השמים הם הגבול אז עם AI גם הם לא... , לכי רחוק !!",
    "proud": "פיתוח עם Loveable ו Cursor , חדשנות וחיסכון של פי 7 בזמן לעומת GPT."
  },
  {
    "time": "02/06/2025 22:25",
    "email": "a0527178668@gmail.com",
    "fullName": "אהובי בלוי",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://picbattle-react.onrender.com/",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "03/06/2025 00:23",
    "email": "sarau0254@gmail.com",
    "fullName": "שרי אולמן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://magicdrawreact.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "03/06/2025 00:33",
    "email": "hadasa5161@gmail.com",
    "fullName": "הדסה קלירס",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://graphomatch.onrender.com",
    "feeling": "זה עבודה מאתגרת אבל עם סיפוק עצום!!!",
    "benefit": "היא תרמה לי רבות- סיפוק, ידע, יכולת לגמור פרויקט שלם בכוחות עצמי, הנאה... וגם כמובן מבחינה מקצועית...",
    "recomendation": "פרויקט מורכב עם הרבה דרישות, כאשר יש מסמך אפיון מפורט זה מקל מאוד, ועד כמה שניתן לא לשנות את הפרויקט ורכיביו בדרך",
    "proud": "על העיצוב המרשים, נושא הפרויקט שנהניתי ממנו והתחברתי אליו והתוצאות והעלאה ברמה שע\"י ה AI"
  },
  {
    "time": "03/06/2025 03:13",
    "email": "shira0556797080@gmail.com",
    "fullName": "שירה גבאי",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://exampro-smart.onrender.com/",
    "feeling": "",
    "benefit": "המון ידע...",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "03/06/2025 04:34",
    "email": "chani0548558941@gmail.com",
    "fullName": "חני ליברמן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://magical-music-client.onrender.com/",
    "feeling": "ברוך ד'",
    "benefit": "הוא חידד לי יכולות פולסטאק אמיתיות – חיבור בין React, .NET, AWS, אבטחה, חוויית משתמש, ו־AI.",
    "recomendation": "תתחילי פשוט –לא הכול בבת אחת. תבני תשתית יציבה, תתקדמי בשלבים, ואל תפחדי לשאול.",
    "proud": "במערכת ניהול השירים, כולל העלאה ל־S3, שמירת מטא־דאטה במסד נתונים, והשמעה דרך נגן מותאם."
  },
  {
    "time": "03/06/2025 10:46",
    "email": "s583281009@gmail.com",
    "fullName": "שושי רביץ",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://fromlearntoworkclient-user.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "03/06/2025 11:56",
    "email": "rivka747343@gmail.com",
    "fullName": "רבקי בית דין",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://client-residents.onrender.com/home https://managingpropertytaxdiscountrequests.onrender.com/",
    "feeling": "",
    "benefit": "הפרויקט תרם לי המון!!!!\nהוא נתן לי להתמודד עם דברים שלא הכרתי לבד\nלמדתי .NET שממש לא ידעתי קודם!\nההתחברות לAI, ניהול הJWT, להעלות מסמכים לAWS דרך קוד ועוד",
    "recomendation": "זה פרויקט גדול ודורש מאד\nאבל הוא שווה מאד!!!!",
    "proud": "חישוב ההנחה האוטומטי ע\"י סריקה של המסמכים עם ה AI ושליפת נתונים,"
  },
  {
    "time": "03/06/2025 13:05",
    "email": "c0533196732@gmail.com",
    "fullName": "חיה קניבסקי",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://smartgradeonline.onrender.com/",
    "feeling": "תחושה של סיפוק. ותודה להשם.",
    "benefit": "המון למידה עצמית, וביטחון עצמי שיש לי את היכולת לבנות מערכת שלמה- מקצה לקצה!",
    "recomendation": "לבדוק קודם כל שאכן הרעיונות שלך כולם ברי ביצוע, להגדיר לעצמך בדיוק על מה את הולכת, והעיקר, לא להתייאש! ותנסי גם להנות.....",
    "proud": "התכנון המקורי שלי היה לבנות מערכת לבדיקת מבחנים אוטומטית, ולא מצאתי API כזה שמנתח כתב יד בעברית באחוזי אמינות מספקים, פשוט לא קיים כזה. הרבה קוד כבר היה כתוב, והיתה לי התלבטות האם להשתמש בAPI של כתב יש באנגלית, או לשנות את האפיון. בסופו של דבר החלטתי לשנות את האפיון כי הרגשתי שכך המערכת יותר תענה על צורך ממשי, ויותר התחברתי לרעיון הנוכחי. הייתי צריכה לשנות הרבה קוד, ולמחוק... זה היה מאתגר, אבל למדתי מזה המון. קודם כל תמיד- לבדוק הכל מראש. וגם- לא להתיאש. וגם- עצם החיפוש, והכתיבה, פשוט נתנו לי עוד ידע ונסיון."
  },
  {
    "time": "03/06/2025 17:38",
    "email": "h4124196@gmail.com",
    "fullName": "דסי שינקר",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://fileflow-uij7.onrender.com/",
    "feeling": "מרגישה שהצלחתי להפוך רעיון למערכת אמיתית – וזה נותן תחושת סיפוק עמוקה ותחושה של מסוגלות אמיתית. ברוך ה'.",
    "benefit": "העבודה על הפרויקט חידדה לי את היכולת לנהל תהליך פיתוח אמיתי – מפיתוח ועד הטמעה, כולל תכנון ארכיטקטוני, ניהול גרסאות, פתרון באגים, וקבלת החלטות טכנולוגיות. היא חיזקה לי את הביטחון העצמי כמתכנתת ונתנה לי טעימה מעולם הפיתוח המלא והמעשי.",
    "recomendation": "אל תחששי להתחיל – גם אם זה נראה גדול ומפחיד, תתחילי ממשהו קטן ותגדלי משם. תעבדי צעד־צעד, תתייעצי כשצריך, ואל תוותרי כשמשהו לא עובד – דווקא מהמקומות התקועים לומדים הכי הרבה. תבני משהו שאת בעצמך היית רוצה להשתמש בו, זה מפתח אותך לחשוב כמו מפתחת מוצר.",
    "proud": "הכי גאה שהצלחתי לבנות מערכת שלמה – ממש מההתחלה עד הסוף. עבדתי על פיצ'ר של העלאת מסמכים עם תיוג אוטומטי לפי תוכן וזה היה גם מאתגר וגם ממש מעניין. כיף לראות שזה עובד בפועל."
  },
  {
    "time": "03/06/2025 18:07",
    "email": "shira6755372@gmail.com",
    "fullName": "שירה שטיינמץ",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://teamtrack-userclient.onrender.com",
    "feeling": "מנצחים רק אחרי דם (טוב-כמעט:) יזע ודמעות😅...וכמובן מלא ס\"ד...",
    "benefit": "הפרויקט קידם אותי כמויותתתתתת...\nהוא ממש שינה את המקצועיות שלי!!\nבלי השוואה לפני ואחרי(לשלוח תמונה להוכחה?:)\nאני מרגישה ממש בשלה לצאת לשוק העבודה.\nמרגישה ששפשפו והכינו אותי הכי שיכול להיות...",
    "recomendation": "תתעודדי😊...\nלא תאמיני.\nאבל גומרים את זה בסוף.\nלוקח ימים ושעות...\nוחושבים על זה בלי סוף...\n\nוזה שווה את זה לגמרי.\nמשפשף אשששש🔥🔥🔥!!!!",
    "proud": "ת'אמת שעל הבאגים עבדתי הכי קשה-אז אותם אני הכי אוהבת😍...\nגם העיצוב ממש חמוד לטעמי:)\nהיה לי לפעמים באגים מצחיקולים שישבתי עליהם הרבה.\nואני מרגישה שפעם הבאה שאני אעשה דבר כזה זה יהיה ממקום הרבה יותר מנוסה וחכם..."
  },
  {
    "time": "03/06/2025 18:31",
    "email": "a83245064@gmail.com",
    "fullName": "אילה יגלניק",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://intellidocs-client-app.onrender.com/",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "03/06/2025 21:09",
    "email": "lea417794@gmail.com",
    "fullName": "לאה זילבר ו3",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://fullstackprojectfrontendreact.onrender.com/",
    "feeling": "סיעתא דשמיא אינסופית!!!!",
    "benefit": "רכשתי מיומנות של למידה עצמית גבוהה והבנה מערכתית מושלמת!",
    "recomendation": "לשבת חזק על ניתוח המודלים והסרבר בפרויקט. לאחר מכן זה משבש מערכות שלמות....",
    "proud": "מהידע הרב שרכשתי ומההתנסות בעבודה עצמאית!"
  },
  {
    "time": "04/06/2025 01:07",
    "email": "z0548498935@gmail.com",
    "fullName": "ציפי פלק",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://examaimanager.onrender.com",
    "feeling": "שאני במילה אחת מרגישה סיפוק, ובהחלט היה לי בכל הדרך הזו גם הנאה!",
    "benefit": "אני מרגישה שאני שולטת בשפות בצורה שלא נראה לי היה אפשר להגיע אחרת, הבנתי שהכל זה פשוט המיומנות ופשוט להיות על הקוד ולתקן באגים ובעיות וככה רק אפשר באמת לדעת!!!\nאני מרגישה הרבה יותר קרובה לפיתוח ממה שהיה קודם!",
    "recomendation": "הייתי מאחלת לך בהצלחה והרבה הנאה, כי אני בסופו של דבר נהניתי מאד!\nוהייתי אומרת שכמה שזה נראה גדול ומפחיד שהכל בסדר ועוברים את זה שלב שלב, הייתי מחכימה אותה בכך שפשוט לא להסס לשאול, אפשר בהחלט לנסות לבד, אבל לא מידי הרבה להתעכב ולנסות להתמודד כי לא תמיד זה חכם, לפעמים צריך לדעת לעבוד נכון! ושפשוט היא יכולה לפנות אלי בכל צורך, ואני אשמח מאד לעזור לה....",
    "proud": "יש לי בהחלט הרבה סיפוק מהעבודה הרבה שעשיתי, אני מרגישה שעברתי גל גדול ובהצלחה מרובה ברוך ד!\nלמרות שקודם זה היה נראה גדול עלי ומפחיד ראיתי שזה עביר ועם הרבה סיפוק אני שמחה להגיש את התוצר שלי."
  },
  {
    "time": "04/06/2025 02:12",
    "email": "s0548493359@gmail.com",
    "fullName": "שיפי סטרול",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://non-stop-music.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "04/06/2025 12:05",
    "email": "sh0556736714@gmail.com",
    "fullName": "שושי נוימן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://frameitreact.onrender.com",
    "feeling": "אלוקים גדול!!",
    "benefit": "ההבנה הרחבה איך הכל מתחבר ביחד מאפס, הסרבר לקליינט והדטה עם השמירת נתונים בענן ואיך צריך לחשוב על בכל ולתכנן מהתחלה... אחרי שהייתי צריכה להרוס מה שבניתי עקב תכנון לקוי.. אבל זאת היתה הלמידה הכי טובה!! וגם איך להשתמש הAI בצורה מיטבית, וכן- ניהול זמן!!",
    "recomendation": "לא להבהל מזה שאולי לא תספיקי- בכל שלב מהרגע של התכנון והבניה- לשבת על זה כאילו זה החלק הכי משמעותי בפרויקט ולא לנסות לקצר תהליכים כדי להתקדם ולהיות עם כולן בקצב!",
    "proud": "כל הדברים והתחומים החדשים שישבתי ללמוד ולהכיר כמו הספריות החדשות, AWS, וכו'"
  },
  {
    "time": "04/06/2025 12:07",
    "email": "sm6736243@gmail.com",
    "fullName": "שולמית מרמרוש",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://practicumproject-client.onrender.com",
    "feeling": "תודה לד'",
    "benefit": "הפרויקט תרם לי להתמודד עם באגים ובעיות לבד ולפתור אותם ללמוד לבד דברים חדשים ,לחפש באינטרנט",
    "recomendation": "לפני ואחרי זה שני דברים,תמיד בסוף זה עובד לא להתיאש!",
    "proud": "פיצר AI צאט,ניתוח תמונה ,יצירת תמונה"
  },
  {
    "time": "04/06/2025 14:56",
    "email": "batya21194@gmail.com",
    "fullName": "בתיה זילברברג",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://travel-memories-react.onrender.com/",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "04/06/2025 15:02",
    "email": "c0556744099@gmail.com",
    "fullName": "חיה חפץ",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://teachshare.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": "אפשר לענות על כל השאלות האלה בהמשך?\nפשוט אני עדיין לא מרגישה שסיימתי..."
  },
  {
    "time": "04/06/2025 18:09",
    "email": "ta0556736501@gmail.com",
    "fullName": "טובה אברמוביץ",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://pro-fit-app.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "04/06/2025 22:52",
    "email": "r0548571067@gmail.com",
    "fullName": "רות גריינימן",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://learnahead.onrender.com",
    "feeling": "",
    "benefit": "",
    "recomendation": "",
    "proud": ""
  },
  {
    "time": "05/06/2025 03:16",
    "email": "yael13269@gmail.com",
    "fullName": "יעל בלוך",
    "sprint": "הגשה | סופי 🎉",
    "appLink": "https://shareyourjoy.onrender.com",
    "feeling": "סיפוק ענק , עשיתי את זה !!! תודה , אין מילים !",
    "benefit": "לא להיבהל ולהתמודד בתבונה עם שגיאות , הבנה לעומק וראייה רחבה עם העולם של הפיתוח \nהכרת דברים חדשים .",
    "recomendation": "מי שלא מנסה לא טועה , פשוט צריך לקפוץ למים ולראות שזה לא כל כך מאיים כמו שזה נשמע בהתחלה \nזה פרויקט עם הרבה סיפוק וחוויה . כיף לי שעשיתי את זה אז תודה!!!",
    "proud": "השתמשתי בספריית ocr לניתוח תמונה , לוגיקה מדוקדקת לפרטי פרטים , AI שמשתמש בניתוח תמונה ,\nחווית משתמש כמו אתר אמיתי, הרבה אפשרויות ואופציות , נראה לי אני לא יכולה לגמור לדבר על הפרויקט אז נעצור כאן... אחרת..."
  }
]