[
  {
    "time": "02/12/2025 02:03:48",
    "email": "nomi7066@gmail.com",
    "fullName": "נעמי זיס",
    "appLink": "https://prostartup.lovable.app/",
    "short": "ProStartUP\nהחסרון העיקרי המרכזי של גוניוריות הוא העדר הנסיון ולכן באתי להציע פתרון מהפכני!\nמערכת שמייצרת ניסיון מוכח, מדריכה ומלווה עד לתוצר אמיתי ותיק עבודות בשטח",
    "reason": "מערכת לבניית עבודות עבור לקוחות פרטיים כדי לעבות תיק עבודות.\nמה שמיוחד במערכת הזו - זה שהמערכת מייצרת מגה פרומפט עבור דרישות הלקוח וניתן להדביק אותו בכלי VIBE CODING ולקבל מוצר מוכן",
    "help": "הגוניורית תהפך לבעלת נסיון בהקמת מערכות ובהבנת צרכי לקוח וממילא תהפך למבוקשת בס\"ד",
    "tool": "Lovable"
  },
  {
    "time": "02/12/2025 14:42:40",
    "email": "shifra012@gmail.com",
    "fullName": "שפרה שטיינמץ",
    "appLink": "https://app-7304a0dc.base44.app/home",
    "short": "אתר למציאת עבודה לג'וניוריות מבוסס על רשת חברתית של הייטקורס. הקשרים של הג'וניורית עם העובדות במשרדים השונים יקדמו אותן במציאת עבודה ובקבלה לעבודה. מגוון העובדות ממקומות העבודה השונים בהייטקורס יכולים ליצור הזדמנויות רבות ל'שידוכים' בין משרות לג'וניוריות. מעין \"חבר מביא חבר\", עוזר גם למקומות עבודה למצוא עובדות איכותיות ושניתן לסמוך על ההמלצות עליהן או לברר עליהן בקלות, ע\"י פרסום בפלטפורמה ממוקדת ואיכותית.",
    "reason": "המיוחד בפרויקט זה ניצול הקהילה של הייטקורס כדי להכניס ג'וניורים מבפנים ולהמליץ עליהם",
    "help": "1. איתור משרות ממוקד למשרות ג'וניור\n2. שימוש בקשרים חברתיים להגשת מועמדות למשרות ולקבלת המשרה\n3. קבלת ליווי אישי ממנטורית, בוגרת הייטקורס שכבר בעולם העבודה (כתיבת קו\"ח, יצירת קשרים, אימון לראיון וכו')",
    "tool": "base44"
  },
  {
    "time": "02/12/2025 17:20:04",
    "email": "yrubinshtein@gmail.com",
    "fullName": "יהודית רובינשטיין",
    "appLink": "https://tefila-balev-210273ec.base44.app/home",
    "short": "כל דבר בחיים וכמובן מציאת עבודה הכל מאיתו יתברך. נעשה השתדלות קטנה ונתפלל אחת על השניה.\n",
    "reason": "גימיק מגניב של תפילה על ג'וניורים עם הגרלת שם לתפילה והגרלת פרק תהילים",
    "help": "כל המתפלל על חברו נענה תחילה - אפליקציה ומערכת ניהול שיתופית לג'וניריות לתפילות, חיזוקים ועוד.\nהאפליקציה כוללת:\n* ניהול שמות לתפילה - המאפשרת להוסיף שמות חדשים, וכן להתפלל על שמות של אחרים.\n* ניהול חיזוקים, שיתופים של סיפורי הצלחה.\n* כולל הגרלת שמות לתפילה\n* הגרלת פרקי תהילים לתפילה,\n* ניהול השמות ויצירת סטטוס לכל שם, מעקב לנצרכות לתפילה, ולאלו שכבר נושעו.\n* תזכורת לתפילה בהתאמה אישית.\n* הוספת AI בבדיקת תוכן של סיפורים אישיים.",
    "tool": "base44"
  },
  {
    "time": "02/12/2025 18:06:41",
    "email": "michallevi82@gmail.com",
    "fullName": "מיכל לוי ולאה שלומוביץ לוי",
    "appLink": "https://futuristic-cv-analys-cyqg.bolt.host",
    "short": "CV Analyzer היא עוזרת קריירה מבוססת בינה מלאכותית שמשנה את תהליך חיפוש העבודה. משתמשים מעלים קורות חיים, מדביקים תיאור משרה, ומקבלים מיידית ניתוח פערים חכם המציג מיומנויות תואמות מול חסרות, תוכנית לימוד מותאמת אישית לסגירת הפערים, וציון התאמה ל-ATS שמבטיח שקורות החיים יעברו מערכות סינון אוטומטיות. עם צ'אט AI בזמן אמת והצעות שיפור אוטומטיות לקורות חיים, אנחנו עוזרים למחפשי עבודה לגשר על הפער בין היכן שהם נמצאים להיכן שהם רוצים להיות - הופכים דחיות לראיונות.",
    "reason": "הגשה של מיכל לוי.\n ניתוח פערים חכם המציג מיומנויות תואמות מול חסרות, תוכנית לימוד מותאמת אישית לסגירת הפערים, וציון התאמה ל-ATS שמבטיח שקורות החיים יעברו מערכות סינון אוטומטיות. עם צ'אט AI בזמן אמת והצעות שיפור אוטומטיות לקורות חיים",
    "help": "יגרום לעבור את המערכות סינון של חברות הגיוס כי יהיה התאמה של מאה אחוז למשרה",
    "tool": "bolt.new"
  },
  {
    "time": "02/12/2025 19:02:04",
    "email": "rachi4840@gmail.com",
    "fullName": "רחל ליבוביץ",
    "appLink": "https://global-connect-9cee7305.base44.app/home",
    "short": "רעיון מיוחד לכל הבנות שיודעות שפה נוספת למציאת עבודה בחברה מחוץ לארץ.",
    "reason": "רעיון יוצא דופן לפתוח דלת למשרות מחו\"ל לדוברות שפה נוספת",
    "help": "יפתח לה שערים רבים נוספים למציאת עבודה לא דווקא במקומות העבודה שכולן ניגשו אליהם",
    "tool": "base44"
  },
  {
    "time": "02/12/2025 20:25:24",
    "email": "dvory7725@gmail.com",
    "fullName": "דבורה גרטנר",
    "appLink": "https://job-prep-ai-5f3d1b55.base44.app/",
    "short": "אפליקציה שמכינה ג'וניורית לראיון ומבחני קבלה לעבודה בהתאם לדרישות המשרה והנחיות בהקשר לראיון והמבחן, אפשר להזין את פרטי המשרה או הפרטים על המבחן והראיון ןהמערכת תציג מבחן בדיוק בתחום,ראיון ושאלות קוד המותאמות בדיוק לפרטי המשרה הספציפית הזו.",
    "reason": "מערכת שמקבלת קורות חיים ופרטי משרה ונותנת גם מבחן מקצועי וגם סימולציה של ראיון מותאם לדרישות המשרה - לא שאלות מוכנות מראש (משלבת 2 סוגים: מבחן וראיון)",
    "help": "יכוון אותה להתכונן בהתאם לפרטי המשרה והמבחן של המשרה הספציפית.",
    "tool": "base44"
  },
  {
    "time": "03/12/2025 04:17:11",
    "email": "et0527180179@gmail.com",
    "fullName": "אלישבע תם",
    "appLink": "https://vibe-coach-80382e8a.base44.app/dashboard",
    "short": "Vibecoach היא מערכת חכמה שמרכזת את כל שלבי חיפוש העבודה במקום אחד: יצירת קורות חיים, שדרוג מסמכים קיימים, סימולטור ראיונות מתקדם עם חיווי בזמן אמת וניתוח ביצועים מראיונות אמיתיים. הפלטפורמה מאפשרת למידה, תרגול ושיפור מהירים שמכינים את המשתמשת לעולם התעסוקה בצורה מעשית ונגישה.",
    "reason": "הרבה פיצ'רים עבור הג'וניור:\nיצירת קורות חיים, שדרוג מסמכים קיימים, סימולטור ראיונות וניתוח ביצועים מראיונות אמיתיים. וגם טיפים מתחלפים ומשפטי מוטיבציה ",
    "help": "המערכת מספקת כלים פרקטיים שממלאים פערי ניסיון: יצירת קורות חיים מקצועיים, אימון על ראיונות בסביבה בטוחה, קבלת הערות בזמן אמת, וניתוח מעמיק של ביצועים. כך המשתמשת מקבלת ביטחון, בהירות ויכולת להגיע לראיונות כשהיא מוכנה יותר — גם ללא ניסיון קודם.",
    "tool": "base44"
  },
  {
    "time": "03/12/2025 15:53:58",
    "email": "shira.sh24@gmail.com",
    "fullName": "שירה גרוסברד",
    "appLink": "https://junior-job-pulse.lovable.app/",
    "short": "רישום לקבלת מייל יומי שכולל את כל משרות הגוניור שקיימות בלינקאין כולל אופציה לקבלת שם לתפילה",
    "reason": "ביצוע שכולל גם SERVER מלא בN8N שלמדה פה בקורס. \nשולפת מהלינקדאין את כל המשרות בלי ניסיון ושולחת מייל יומי\nלטובת אלה שאין להן לינקדאין.  עם גימיק של קבלת שם לתפילה ועדכון ברגע שהיא מצאה ואפשר להחליף שם.",
    "help": "גישה למשרות בלינקאין שלא קיים בעקבות חסימה וכמובן תפילה",
    "tool": "N8N BASE 44"
  }
]